
# Working with a real world data-set using SQL and Python

## Objectives

After completing this lab you will be able to:

-   Understand the dataset for Chicago Public School level performance
-   Store the dataset in an Db2 database on IBM Cloud instance
-   Retrieve metadata about tables and columns and query data from mixed case columns
-   Solve example problems to practice your SQL skills including using built-in database functions

## Chicago Public Schools - Progress Report Cards (2011-2012)

The city of Chicago released a dataset showing all school level performance data used to create School Report Cards for the 2011-2012 school year. The dataset is available from the Chicago Data Portal: [https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t](https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?cm_mmc=Email_Newsletter-_-Developer_Ed%2BTech-_-WW_WW-_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ&cm_mmc=Email_Newsletter-_-Developer_Ed%2BTech-_-WW_WW-_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

This dataset includes a large number of metrics. Start by familiarizing yourself with the types of metrics in the database: [https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?download=true](https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?download=true&cm_mmc=Email_Newsletter-_-Developer_Ed%2BTech-_-WW_WW-_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### Connect to the database

Let us now load the ipython-sql  extension and establish a connection with the database

In [1]:
%load_ext sql

In [3]:
# Enter the connection string for your Db2 on Cloud database instance below
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name
%sql ibm_db_sa://flb63190:r66zz-lhg1pw73gs@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB

'Connected: flb63190@BLUDB'

### Query the database system catalog to retrieve table metadata

In [6]:
# type in your query to retrieve list of all tables in the database for your db2 schema (username)
%sql select TABSCHEMA,TABNAME,CREATE_TIME from SYSCAT.TABLES\
where TABSCHEMA='flb63190'

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[]

### Query the database system catalog to retrieve column metadata

##### The SCHOOLS table contains a large number of columns.

In [9]:
# type in your query to retrieve the number of columns in the SCHOOLS table
%sql select * from SYSCAT.COLUMNS where TABNAME='SCHOOLS'

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[]

Now to retrieve the the list of columns in SCHOOLS table and their column type (datatype) and length.

In [11]:
# type in your query to retrieve all column names in the SCHOOLS table along with their datatypes and length
%sql select COLNAME, TYPENAME, LENGTH from SYSCAT.COLUMNS where TABNAME = 'SCHOOLS'

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[]

## Problems



##### Find the number of Elementary Schools in the dataset.

In [20]:
%sql select Count(*) as Elementary_school from CHICAGO_PUBLIC_SCHOOLS where "Elementary, Middle, or High School"='ES'

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('462'),)]



### To find the highest Safety Score.

In [22]:

%sql select max(SAFETY_SCORE)as Safety_score from CHICAGO_PUBLIC_SCHOOLS

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.
 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[(99,)]

### To find the  highest Safety Score

In [23]:
%sql select NAME_OF_SCHOOL, SAFETY_SCORE from CHICAGO_PUBLIC_SCHOOLS where SAFETY_SCORE=(Select Max(SAFETY_SCORE) from CHICAGO_PUBLIC_SCHOOLS )

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('Abraham Lincoln Elementary School', 99),
 ('Alexander Graham Bell Elementary School', 99),
 ('Annie Keller Elementary Gifted Magnet School', 99),
 ('Augustus H Burley Elementary School', 99),
 ('Edgar Allan Poe Elementary Classical School', 99),
 ('Edgebrook Elementary School', 99),
 ('Ellen Mitchell Elementary School', 99),
 ('James E McDade Elementary Classical School', 99),
 ('James G Blaine Elementary School', 99),
 ('LaSalle Elementary Language Academy', 99),
 ('Mary E Courtenay Elementary Language Arts Center', 99),
 ('Northside College Preparatory High School', 99),
 ('Northside Learning Center High School', 99),
 ('Norwood Park Elementary School', 99),
 ('Oriole Park Elementary School', 99),
 ('Sauganash Elementary School', 99),
 ('Stephen Decatur Classical Elementary School', 99),
 ('Talman Elementary School', 99),
 ('Wildwood Elementary School', 99)]

###  Top 5 schools with the highest "Average Student Attendance".

In [32]:
%sql select NAME_OF_SCHOOL, AVERAGE_STUDENT_ATTENDANCE from CHICAGO_PUBLIC_SCHOOLS \
order by AVERAGE_STUDENT_ATTENDANCE DESC NULLS LAST Limit 5

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('John Charles Haines Elementary School', '98.40%'),
 ('James Ward Elementary School', '97.80%'),
 ('Edgar Allan Poe Elementary Classical School', '97.60%'),
 ('Orozco Fine Arts & Sciences Elementary School', '97.60%'),
 ('Rachel Carson Elementary School', '97.60%')]

###  Retrieve the list of 5 Schools with the lowest Average Student Attendance sorted in ascending order based on attendance

In [38]:
%sql SELECT Name_of_School, Average_Student_Attendance  \
     from CHICAGO_PUBLIC_SCHOOLS \
     order by Average_Student_Attendance \
     fetch first 5 rows only

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%')]

### Remove the '%' sign from the above result set for Average Student Attendance column

In [45]:
%sql select Name_of_school,replace(Average_Student_Attendance, '%', '')\
from CHICAGO_PUBLIC_SCHOOLS\
order by Average_Student_Attendance limit 5

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00'),
 ('Orr Academy High School', '66.30')]

### Schools which have Average Student Attendance lower than 70%.

In [82]:
%sql SELECT Name_of_School, Average_Student_Attendance  \
     from CHICAGO_PUBLIC_SCHOOLS \
where decimal "Average_Student_Attendance"  < 70.00)\
#where REPLACE(Average_Student_Attendance,'%','') < 70 \
#where 'Average_Student_Attendance' < '70.00' \
order by Average_Student_Attendance Limit 10

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: SQLNumResultCols failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0104N  An unexpected token "decimal "Average_Student_Attendance"  < 7" was found following "UBLIC_SCHOOLS  where".  Expected tokens may include:  "<space>".  SQLSTATE=42601 SQLCODE=-104
[SQL: SELECT Name_of_School, Average_Student_Attendance        from CHICAGO_PUBLIC_SCHOOLS  where decimal "Average_Student_Attendance"  < 70.00) #where REPLACE(Average_Student_Attendance,'%','') < 70  #where 'Average_Student_Attendance' < '70.00'  order by Average_Student_Attendance Limit 10]
(Background on this error at: http://sqlalche.me/e/13/f405)

### The total College Enrollment for each Community Area

In [101]:
%sql SELECT COMMUNITY_AREA_NAME, SUM(College_Enrollment) as Total_enrollment from CHICAGO_PUBLIC_SCHOOLS\
group by COMMUNITY_AREA_NAME LIMIT 10
#where COMMUNITY_AREA_NAME = SUM

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('ALBANY PARK', 6864),
 ('ARCHER HEIGHTS', 4823),
 ('ARMOUR SQUARE', 1458),
 ('ASHBURN', 6483),
 ('AUBURN GRESHAM', 4175),
 ('AUSTIN', 10933),
 ('AVALON PARK', 1522),
 ('AVONDALE', 3640),
 ('BELMONT CRAGIN', 14386),
 ('BEVERLY', 1636)]

###   5 Community Areas with the least total College Enrollment  sorted in ascending order

In [115]:
%sql SELECT COMMUNITY_AREA_NAME, SUM(College_Enrollment) as Total_enrollment from CHICAGO_PUBLIC_SCHOOLS\
group by COMMUNITY_AREA_NAME\
order by SUM(College_Enrollment)  DESC\
LIMIT 10

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('SOUTH LAWNDALE', 14793),
 ('BELMONT CRAGIN', 14386),
 ('AUSTIN', 10933),
 ('GAGE PARK', 9915),
 ('BRIGHTON PARK', 9647),
 ('WEST TOWN', 9429),
 ('HUMBOLDT PARK', 8620),
 ('WEST RIDGE', 8197),
 ('NEAR WEST SIDE', 7975),
 ('NEW CITY', 7922)]

### Hardship index for the community area which has College Enrollment of 4368

In [172]:
%sql select hardship_index from chicago_socioeconomic_data\
where ca in(select community_area_number from CHICAGO_PUBLIC_SCHOOLS\
           where college_enrollment = 4368  )

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[(6.0,)]

<details><summary>Click here for the solution</summary>

```python
# For this solution to work the CHICAGO_SOCIOECONOMIC_DATA table as created in the last lab of Week 3 should already exist

%%sql 
select hardship_index 
   from chicago_socioeconomic_data CD, schools CPS 
   where CD.ca = CPS.community_area_number 
      and college_enrollment = 4368

```

</details>

### Hardship index for the community area which has the highest value for College Enrollment

In [169]:
%sql select ca,community_area_name, hardship_index from chicago_socioeconomic_data\
where ca in (select community_area_number from CHICAGO_PUBLIC_SCHOOLS\
order by college_enrollment desc limit 1)

 * ibm_db_sa://flb63190:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[(5.0, 'North Center', 6.0)]

## Summary

##### In this lab you learned how to work with a real word dataset using SQL and Python. You learned how to query columns with spaces or special characters in their names and with mixed case names. You also used built in database functions and practiced how to sort, limit, and order result sets, as well as used sub-queries and worked with multiple tables.